Revit 2027 API
KeyBasedTreeEntriesLoadResults.GetKeyBasedTreeEntryErrors Method
 Gets information about KeyBasedTreeEntry objects that could not be included in the KeyBasedTreeEntries object due to errors.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<KeyBasedTreeEntryError> GetKeyBasedTreeEntryErrors()
Public Function GetKeyBasedTreeEntryErrors As IList(Of KeyBasedTreeEntryError)
public:
IList<KeyBasedTreeEntryError^>^ GetKeyBasedTreeEntryErrors()
member GetKeyBasedTreeEntryErrors : unit -> IList<KeyBasedTreeEntryError>
Return Value
IList<KeyBasedTreeEntryError>
 An array of copies of the KeyBasedTreeEntryErrors contained in this object.
See Also
Reference
KeyBasedTreeEntriesLoadResults Class
GetKeyBasedTreeEntryErrors Overload
Autodesk.Revit.DB Namespace